package control.ifstmt;

/**
 * 입력된 정수에 대해서 2의 배수인지 판별하는 클래스
 * 
 * Scanner 를 사용하여 입력된 정수를 input 변수에 저장하고 
 * 입력된 값이 2의 배수인지 판단하는 조건을 작성하시오.
 * 2의 배수 판별 결과는 String result 에 저장하시오.
 * 
 * -- (1) ------------------------------------------------------
 * 2의 배수일 때 : "입력값 4 은(는) 2의 배수입니다."
 * 2의 배수가 아닐 때 : "입력값 5 은(는) 2의 배수가 아닙니다."
 *  
 * -- (2) ------------------------------------------------------
 * 나머지는 int mod; 에 저장하여 사용하시오.
 * 
 * 2의 배수일 때 : "입력값 4 은(는) 2의 배수입니다."
 * 2의 배수가 아닐 때 : 
 *     "입력값 5 은(는) 2의 배수가 아닙니다."
 *     "나머지가 1 입니다."
 * --------------------------------------------------------    
 * 
 * @author 304
 *
 */
public class MultipleOfTwo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
